# cate.py

CM_CATEGORIES = {
    "補虛藥 - 補氣": ["西洋參", "人參", "大棗", "黃耆", "甘草", "山藥", "白扁豆", "黨參"],
    "補虛藥 - 補血": ["當歸", "地黄", "白芍", "何首烏", "阿膠"],
    "補虛藥 - 補陰": ["楮實子", "女貞子", "石斛", "天門冬", "麥門冬", "百合", "知母", "黃精", "枸杞子", "龜板"],
    "補虛藥 - 補陽": ["巴戟天", "菟絲子", "沙苑蒺藜", "肉蓯蓉", "杜仲", "續斷", "鹿茸", "淫羊藿", "補骨脂", "冬蟲夏草", "鎖陽"],
    "溫裏藥": ["吳茱萸", "高良薑", "炮薑", "丁香", "肉桂", "細辛", "小茴香", "附子"],
    "理氣藥": ["沉香", "枳實", "枳殼", "香附", "烏藥", "陳皮"],
    "平肝息風藥": ["天麻", "白殭蠶", "鉤藤"],
    "安神藥": ["遠志", "柏子仁", "酸棗仁"],
    "收澀藥": ["五味子", "山茱萸", "訶子", "蓮子", "芡實", "覆盆子"],
    "解表藥 - 辛溫": ["麻黃", "辛夷", "紫蘇葉", "生薑", "荊芥", "蒼耳子", "白芷", "蔥白", "防風", "羌活", "香薷"],
    "解表藥 - 辛涼": ["牛蒡子", "薄荷", "葛根", "菊花", "柴胡", "升麻", "淡豆豉", "蔓荊子"],
    "化痰止咳平喘 - 化痰": ["胖大海", "貝母", "竹茹", "桔梗", "前胡", "昆布", "萊菔子", "旋覆花", "半夏", "皂莢", "皂角刺"],
    "化痰止咳平喘 - 止咳平喘": ["桑白皮", "紫菀", "杏仁", "枇杷葉", "白果", "百部"],
    "利水滲濕藥": ["木通", "車前子", "燈心草", "萹蓄", "瞿麥", "澤瀉", "白朮", "豬苓", "茯苓"],
    "芳香化濕藥": ["砂仁", "廣藿香", "厚朴", "蒼朮"],
    "祛風濕藥": ["桑寄生", "威靈仙", "獨活", "五加皮", "秦艽"],
    "消食藥": ["山楂", "神麴", "麥芽", "穀芽"],
    "攻下藥": ["大黄", "火麻仁", "蘆薈"],
    "活血祛瘀藥": ["蘇木", "丹參", "紅花", "血竭", "水蛭", "牛膝", "乳香", "延胡索", "薑黃", "川芎", "桃仁", "益母草"],
    "止血藥": ["側柏葉", "白及", "艾葉", "三七", "槐花"],
    "清熱藥 - 清熱解毒": ["射干", "蒲公英", "連翹", "山豆根", "北板藍根", "敗醬草", "金銀花"],
    "清熱藥 - 清熱瀉火": ["蘆根", "栝蔞根", "夏枯草", "淡竹葉", "梔子"],
    "清熱藥 - 清熱燥濕": ["苦參", "龍膽", "黃柏", "黄芩", "黃連"],
    "清熱藥 - 清熱涼血": ["玄參", "紫草", "赤芍", "牡丹皮"],
    "清虛熱藥": ["青蒿", "地骨皮"],
    "外用藥": ["蛇床子"],
    "驅蟲藥": ["檳榔"]
}

def search_herb(keyword):
    results = []
    if not keyword:
        return results
        
    kw = keyword.strip()
    for cat, herbs in CM_CATEGORIES.items():
        for herb in herbs:
            if kw in herb:
                results.append({"herb": herb, "category": cat})
    return results